package com.telran.lessons.lesson10;

public class Lesson10 {
    public static void main(String[] args) {

//            int x = 3;
//            int y = 3;
//
//            int a = --x;
//            int b = y--;
//
//
//
//            System.out.println("a = " + a); // 2
//            System.out.println("x = " + x); // 2
//            System.out.println("b = " + b); // 3
//            System.out.println("y = " + y); // 2
        //Создать программу, выводящую на экран ближайшее к 10 из двух чисел, записанных в переменные m и n.
        //Числа могут быть, как целочисленные, так и дробные.
        //Например :
        //ввод : m=10.5, n=10.45
        //вывод: Число 10.45 ближе к 10.
        }
    }
