package com.telran.lessons.lesson08;

public class UnaryTest {

        public static void main(String[] args) {
//            // 2. Создаем переменную с положительным знаком
//            int positiveNumber = 5;
//
//            // 3. Изменяем знак на отрицательный используя унарный минус
//
//
//            // 4. Результат распечатываем в консоле
//            System.out.println(-positiveNumber);
            //Создайте класс UnaryTest
            //2. Создайте переменную с положительным знаком
            //3. Примените к переменной пост-инкремент и пост-декремент
            //4. Примените к переменной пре-инкремент и пре-декремент
            //5. Используя режим дебаггера проследите изменения
//
//            int a = 7;
//            int b = a++;   //a = 8
//            b =++a;      // b = 9 и a = 9
//            int c = a--;  // a = 8
//            c=--a; // c = 7
//            System.out.println(a +" " +b +" " + c);



//                    int a = 5;
//                    int b = 10;
//                    int c = 5;
//
////                    boolean result1 = a > b;
////                    boolean result2 = a < b;
////                    boolean result3 = b > c;
////                    boolean result4 = b < c;
////                    boolean result5 = a == c;
////                    boolean result6 = b != c;
//
//
//                    System.out.println(a > b);
//                    System.out.println(a < b);
//                    System.out.println(b > c);
//                    System.out.println(b < c);
//                    System.out.println(a == c);
//                    System.out.println(b != c);




                    int a = 1;
                    int b = 2;
                    int c = 2;
                    int d = 4;


                    if (a < b && b == c) {
                        System.out.println("истинно если: 'a' меньше 'b' и 'b' равно 'c'.");
                    }


                    if (a > b || c == d) {
                        System.out.println(" b истинно: 'a' больше 'b' или 'c' равно 'd'.");
                    }


                    if (a != b) {
                        System.out.println(" c истинно: 'a' не равно 'b'.");
                    }
                }
            }









